12/data/attachments/30df4ddbb25d6fce.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Rodney_who_Friend_85158_1</nif:username>
            <nif:friendToBeRequested>soap_friends_96174e0f-7c12-4fd6-8959-083d7615408d</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>